# Assignment 2: Complex Queries (100 points total)

Complete the problems in this notebook.
It does not matter whether you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

The following is the generic grading scheme when more specific grading guidelines don't apply (either because there are no more specific guidelines, or the student solution doesn't match the guidelines well).
* 100% correct
*  80% very close to correct (either semantically close -- gets almost all cases correct, or syntactically close -- a small change would fix it)
*  60% mostly correctly ideas, but needs work
*  40% inputs and outputs are of the right form, and computation has some correct ideas, but far from correct/complete
*  20% some minimal correct ideas, but mostly wrong

First, the standard preliminary steps.  For security, don't include your riceuser password.

In [1]:
%load_ext sql

In [2]:
%sql postgresql://riceuser:ricepassword@localhost/ricedb

'Connected: riceuser@ricedb'

# Problem 1 (20 points total)

We provide SQL code to create a table with some data.  You will write SQL queries having the desired output.  In this problem, the behavior is described by example.

In [3]:
%%sql

DROP TABLE IF EXISTS Purchase CASCADE;

CREATE TABLE Purchase (
    customer INT,                 -- ID of purchasing customer 
    item     INT,                 -- ID of purchased item 
    price    MONEY,               -- price of each purchased item
    quantity INT,                 -- quantity of items purchased
    PRIMARY KEY (customer, item)
);

INSERT INTO Purchase (customer, item, price, quantity)
VALUES 
    (12567, 654,  7.00,  1),
    (15443, 423,  5.00, 23),
    (15443, 654,  6.50,  8),
    (28244, 766, 10.00,  1),
    (75245, 423,  5.50,  2);

Done.
Done.
5 rows affected.

[]

## Part a (5 points)

Write a SQL query that generates the following results from the data.

| total_quantity |
|:---------------|
|             35 |

In [5]:
%%sql
SELECT Sum(quantity) AS total_quantity
FROM Purchase;

1 rows affected.

[(35,)]

## Part b (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| customer | item |  price  | quantity  | total_price  |
|:---------|:-----|:--------|:----------|:-------------|
| 12567    | 654  | \$7.00  | 1         | \$7.00       |
| 15443    | 423  | \$5.00  | 23        | \$115.00     |
| 15443    | 654  | \$6.50  | 8         | \$52.00      |
| 28244    | 766  | \$10.00 | 1         | \$10.00      |
| 75245    | 423  | \$5.50  | 2         | \$11.00      |

In [6]:
%%sql
SELECT customer, item, price, quantity, price * quantity AS total_price
FROM Purchase;

5 rows affected.

[(12567, 654, '$7.00', 1, '$7.00'),
 (15443, 423, '$5.00', 23, '$115.00'),
 (15443, 654, '$6.50', 8, '$52.00'),
 (28244, 766, '$10.00', 1, '$10.00'),
 (75245, 423, '$5.50', 2, '$11.00')]

## Part c (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| item | total_quantity |
|:-----|:---------------|
| 654  | 9              |
| 423  | 25             |
| 766  | 1              |

In [9]:
%%sql
SELECT item, Sum(quantity) AS total_quantity
FROM Purchase
GROUP BY item
ORDER BY item;

3 rows affected.

[(423, 25), (654, 9), (766, 1)]

## Part d (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| customer | total_price |
|:---------|:------------|
|    12567 |      \$7.00 |
|    15443 |    \$167.00 |
|    28244 |     \$10.00 |
|    75245 |     \$11.00 |

In [10]:
%%sql
SELECT customer, Sum(price * quantity) AS total_price
FROM Purchase
GROUP BY customer;

4 rows affected.

[(75245, '$11.00'), (12567, '$7.00'), (28244, '$10.00'), (15443, '$167.00')]

# Problem 2 (68 points total)

For this problem, we'll give you the following schemas and data.  We are modeling a climbing club, where groups of members go together on climbs to various mountain peaks.

Schemas:

* Peak (<u>peak_rank</u>, peak_name, peak_state, peak_range, peak_elevation) --
  The elevation is in meters.
* Climber (<u>climber_name</u>, gender) --
  For brevity, we'll assume distinct names.
* Participate (<u>climb_id</u>, <u>climber_name</u>)
* Climb (<u>climb_id</u>, peak_rank, climb_date)
  
We suggest but don't require that you use `WITH` to make your queries more readable.

In [17]:
%%sql

DROP TABLE IF EXISTS Participate CASCADE;
DROP TABLE IF EXISTS Climb CASCADE;
DROP TABLE IF EXISTS Climber CASCADE;
DROP TABLE IF EXISTS Peak CASCADE;

CREATE TABLE Peak (
    peak_rank INT,
    peak_name TEXT,
    peak_state TEXT,
    peak_range TEXT,
    peak_elevation FLOAT,
    PRIMARY KEY (peak_rank)
);

CREATE TABLE Climber (
    climber_name TEXT,
    gender char(1),
    PRIMARY KEY (climber_name)
);

CREATE TABLE Climb (
    climb_id INT,
    peak_rank INT,
    climb_date DATE,
    PRIMARY KEY (climb_id)
);

CREATE TABLE Participate (
    climb_id INT,
    climber_name TEXT,
    PRIMARY KEY (climb_id, climber_name),
    FOREIGN KEY (climber_name) REFERENCES Climber (climber_name),
    FOREIGN KEY (climb_id) REFERENCES Climb (climb_id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

The assignment provides the data file `usmountains.csv`, which has data on the 200 highest mountains in the U.S.  Save that onto your computer and note its absolute pathname.  Run psql, log in as riceuser, and use the psql command
`\copy Peak FROM 'pathname' CSV HEADER`, substituting the appropriate pathname.

In [18]:
%%sql

DELETE FROM Participate;
DELETE FROM Climb;
DELETE FROM Climber;

INSERT INTO Climber (climber_name, gender)
VALUES
    ('Anna',   'F'),
    ('Beth',   'F'),
    ('Chad',   'M'),
    ('David',  'M'),
    ('Ellen',  'F'),
    ('Frank',  'M'),
    ('George', 'M');

INSERT INTO Climb (climb_id, peak_rank, climb_date)
VALUES
    (1, 1, '2015-01-01'),
    (2, 5, '2016-01-16'),
    (3, 9, '2016-01-30'),
    (4, 1, '2016-02-04'),
    (5, 9, '2015-01-02'),
    (6, 12, '2015-04-04'),
    (7, 15, '2016-01-12'),
    (8, 15, '2017-05-20'),
    (9, 43, '2017-01-28'),
    (10, 136, '2017-04-08');

INSERT INTO Participate (climb_id, climber_name)
VALUES
    (1, 'Beth'),
    (1, 'Ellen'),
    (1, 'David'),
    (2, 'Beth'),
    (2, 'Ellen'),
    (3, 'Anna'),
    (3, 'Chad'),
    (3, 'David'),
    (3, 'Frank'),
    (5, 'Anna'),
    (6, 'Anna'),
    (7, 'Anna'),
    (7, 'Chad'),
    (8, 'Chad'),
    (9, 'David'),
    (9, 'Beth'),
    (10, 'David'),
    (10, 'Beth');

0 rows affected.
0 rows affected.
0 rows affected.
7 rows affected.
10 rows affected.
18 rows affected.

[]

## Part a (5 points)

For each mountain range (listed alphabetically), what is its elevation range, i.e., the elevation difference between the highest and lowest peaks?

In [21]:
%%sql
SELECT peak_range, Max(peak_elevation) - Min(peak_elevation) AS difference
FROM Peak
GROUP BY peak_range
ORDER BY peak_range;

54 rows affected.

[('Absaroka Range', 304.0),
 ('Alaska Range', 2551.5),
 ('Beartooth Mountains', 0.0),
 ('Bighorn Mountains', 0.0),
 ('Cascade Range', 650.6),
 ('Chugach Mountains', 355.0),
 ('Cimarron Range', 0.0),
 ('Culebra Range', 446.2),
 ('Deep Creek Range', 0.0),
 ('Elk Mountains', 643.2),
 ('Flat Tops', 0.0),
 ('Front Range', 544.0),
 ('Gore Range', 114.0),
 ('Island of Hawaii', 38.3000000000002),
 ('Kenosha Mountains', 0.0),
 ('La Garita Mountains', 569.6),
 ('La Plata Mountains', 0.0),
 ('La Sal Mountains', 0.0),
 ('Lemhi Range', 0.0),
 ('Lost River Range', 0.0),
 ('Medicine Bow Mountains', 286.0),
 ('Mosquito Range', 292.5),
 ('Mummy Range', 0.0),
 ('Needle Mountains', 284.0),
 ('Never Summer Mountains', 0.0),
 ('Park Range', 0.0),
 ('Rabbit Ears Range', 0.0),
 ('Sacramento Mountains', 0.0),
 ('Saint Elias Mountains', 1855.0),
 ('San Francisco Peaks', 0.0),
 ('San Juan Mountains', 695.7),
 ('San Miguel Mountains', 690.0),
 ('Sangre de Cristo Mountains', 735.7),
 ('Sangre de Cristo Range', 0.0),
 ('Santa Fe Mountains', 145.1),
 ('Sawatch Range', 730.5),
 ('Sierra Nevada', 723.2),
 ('Snake Range', 302.7),
 ('Sneffels Range', 0.0),
 ('Spanish Peaks', 288.0),
 ('Spring Mountains', 0.0),
 ('Taos Mountains', 130.3),
 ('Tarryall Mountains', 0.0),
 ('Teton Range', 355.2),
 ('Toquima Range', 0.0),
 ('Tushar Mountains', 0.0),
 ('Uinta Mountains', 0.0),
 ('Wasatch Range', 0.0),
 ('West Elk Mountains', 299.8),
 ('Wet Mountains', 0.0),
 ('White Mountains', 209.0),
 ('Williams Mountains', 0.0),
 ('Wind River Range', 529.1),
 ('Wrangell Mountains', 1335.0)]

## Part b (6 points)

What are the names of peaks scheduled for only one climbing trip?  It is irrelevant if anyone actually went on the climbing trip.

In [26]:
%%sql
SELECT peak_name
FROM Peak
INNER JOIN Climb ON Peak.peak_rank = Climb.peak_rank
GROUP BY peak_name
HAVING Count(*) = 1;

4 rows affected.

[('Mount Blackburn',),
 ('Culebra Peak',),
 ('Little Costilla Peak',),
 ('Mount Alverstone\n (Boundary Point )',)]

## Part c (12 points -- 6 points each query)

For each range (listed alphabetically), what is the average height of the unclimbed peaks?  If a climb was scheduled, but no climber actually participated it, then the peak was not actually climbed then.  If a range has no unclimbed peaks, it should not be listed.

First, a version using set membership: `IN` or `NOT IN`.  You cannot use joins, (multi)set operations, or quantification.

In [38]:
%%sql
SELECT peak_range, AVG(peak_elevation) AS avg_range_unclimbed
FROM Peak
WHERE peak_rank NOT IN(
    SELECT peak_rank
    FROM Climb
    WHERE climb_id IN(
        SELECT climb_id
        FROM Participate
    )
)
GROUP BY peak_range
ORDER BY peak_range;

53 rows affected.

[('Absaroka Range', 3819.46666666667),
 ('Alaska Range', 3981.14285714286),
 ('Beartooth Mountains', 3903.5),
 ('Bighorn Mountains', 4013.3),
 ('Cascade Range', 4153.06666666667),
 ('Chugach Mountains', 3831.0),
 ('Cimarron Range', 3793.3),
 ('Deep Creek Range', 3686.0),
 ('Elk Mountains', 4039.6625),
 ('Flat Tops', 3767.7),
 ('Front Range', 4190.531),
 ('Gore Range', 4084.0),
 ('Island of Hawaii', 4188.15),
 ('Kenosha Mountains', 3790.0),
 ('La Garita Mountains', 3989.0),
 ('La Plata Mountains', 4035.0),
 ('La Sal Mountains', 3879.0),
 ('Lemhi Range', 3719.3),
 ('Lost River Range', 3861.2),
 ('Medicine Bow Mountains', 3805.4),
 ('Mosquito Range', 4210.25),
 ('Mummy Range', 4137.0),
 ('Needle Mountains', 4154.0),
 ('Never Summer Mountains', 3946.0),
 ('Park Range', 3714.0),
 ('Rabbit Ears Range', 3749.4),
 ('Sacramento Mountains', 3651.8),
 ('Saint Elias Mountains', 4067.72727272727),
 ('San Francisco Peaks', 3852.0),
 ('San Juan Mountains', 4052.94666666667),
 ('San Miguel Mountains', 3932.62),
 ('Sangre de Cristo Mountains', 3947.42),
 ('Sangre de Cristo Range', 4359.0),
 ('Santa Fe Mountains', 3922.65),
 ('Sawatch Range', 4184.74285714286),
 ('Sierra Nevada', 4099.37368421053),
 ('Snake Range', 3830.95),
 ('Sneffels Range', 4315.4),
 ('Spanish Peaks', 4011.0),
 ('Spring Mountains', 3632.0),
 ('Taos Mountains', 3948.15),
 ('Tarryall Mountains', 3789.4),
 ('Teton Range', 4021.1),
 ('Toquima Range', 3641.0),
 ('Tushar Mountains', 3710.7),
 ('Uinta Mountains', 4125.0),
 ('Wasatch Range', 3637.0),
 ('West Elk Mountains', 3800.22857142857),
 ('Wet Mountains', 3765.0),
 ('White Mountains', 4239.5),
 ('Williams Mountains', 4081.0),
 ('Wind River Range', 3900.5),
 ('Wrangell Mountains', 4243.83333333333)]

Next, a version with set or multiset operations: `UNION`, `INTERSECT`, or `EXCEPT`, possibly with `... ALL`.  You can use one group of joins.  You cannot use set membership or quantification.

In [46]:
%%sql
SELECT peak_range, AVG(peak_elevation) AS avg_range_unclimbed
FROM (SELECT peak_rank
    FROM Peak
    EXCEPT
    SELECT peak_rank
    FROM Climb
    INNER JOIN Participate ON Climb.climb_id = Participate.climb_id) AS not_part(peak_rank)
INNER JOIN Peak ON Peak.peak_rank = not_part.peak_rank
GROUP BY peak_range
ORDER BY peak_range;

53 rows affected.

[('Absaroka Range', 3819.46666666667),
 ('Alaska Range', 3981.14285714286),
 ('Beartooth Mountains', 3903.5),
 ('Bighorn Mountains', 4013.3),
 ('Cascade Range', 4153.06666666667),
 ('Chugach Mountains', 3831.0),
 ('Cimarron Range', 3793.3),
 ('Deep Creek Range', 3686.0),
 ('Elk Mountains', 4039.6625),
 ('Flat Tops', 3767.7),
 ('Front Range', 4190.531),
 ('Gore Range', 4084.0),
 ('Island of Hawaii', 4188.15),
 ('Kenosha Mountains', 3790.0),
 ('La Garita Mountains', 3989.0),
 ('La Plata Mountains', 4035.0),
 ('La Sal Mountains', 3879.0),
 ('Lemhi Range', 3719.3),
 ('Lost River Range', 3861.2),
 ('Medicine Bow Mountains', 3805.4),
 ('Mosquito Range', 4210.25),
 ('Mummy Range', 4137.0),
 ('Needle Mountains', 4154.0),
 ('Never Summer Mountains', 3946.0),
 ('Park Range', 3714.0),
 ('Rabbit Ears Range', 3749.4),
 ('Sacramento Mountains', 3651.8),
 ('Saint Elias Mountains', 4067.72727272727),
 ('San Francisco Peaks', 3852.0),
 ('San Juan Mountains', 4052.94666666667),
 ('San Miguel Mountains', 3932.62),
 ('Sangre de Cristo Mountains', 3947.42),
 ('Sangre de Cristo Range', 4359.0),
 ('Santa Fe Mountains', 3922.65),
 ('Sawatch Range', 4184.74285714286),
 ('Sierra Nevada', 4099.37368421053),
 ('Snake Range', 3830.95),
 ('Sneffels Range', 4315.4),
 ('Spanish Peaks', 4011.0),
 ('Spring Mountains', 3632.0),
 ('Taos Mountains', 3948.15),
 ('Tarryall Mountains', 3789.4),
 ('Teton Range', 4021.1),
 ('Toquima Range', 3641.0),
 ('Tushar Mountains', 3710.7),
 ('Uinta Mountains', 4125.0),
 ('Wasatch Range', 3637.0),
 ('West Elk Mountains', 3800.22857142857),
 ('Wet Mountains', 3765.0),
 ('White Mountains', 4239.5),
 ('Williams Mountains', 4081.0),
 ('Wind River Range', 3900.5),
 ('Wrangell Mountains', 4243.83333333333)]

## Part d (10 points)

What peak has been climbed in the most climbing trips?  If there is a tie, the result should have all those peaks that tie.
If a climb was scheduled, but no climber actually participated it, then the peak was not actually climbed then, and that should not be counted in this query.

In [93]:
%%sql
WITH freq AS(
    SELECT peak_name, Count(DISTINCT Participate.climb_id) AS most_freq
    FROM Climb
    INNER JOIN Peak ON Climb.peak_rank = Peak.peak_rank
    INNER JOIN Participate ON Climb.climb_id = Participate.climb_id
    GROUP BY peak_name
)
SELECT peak_name, most_freq
FROM freq
WHERE most_freq = 
    (SELECT MAX(most_freq) FROM freq)

2 rows affected.

[('Mount Bear', 2), ('Mount Massive', 2)]

## Part e (10 points)

For each gender, what is the total elevation gained by everyone of that gender?  The "total elevation gained" is the sum of all of the heights of all peaks climbed.  The elevation of each peak climbed is included for each of its climbers.

In [62]:
%%sql
WITH gender_ele AS(
    SELECT peak_name, peak_elevation, gender
    FROM Peak
    INNER JOIN Climb ON Peak.peak_rank = Climb.peak_rank
    INNER JOIN Participate ON Climb.climb_id = Participate.climb_id
    INNER JOIN Climber ON Participate.climber_name = Climber.climber_name
)
SELECT gender, SUM(peak_elevation) AS total_elevation
FROM gender_ele
GROUP BY gender;

2 rows affected.

[('F', 48350.8), ('M', 36666.3)]

## Part f (10 points)

What are the names of the climbers who climbed their first peak before 'Anna' climbed her first peak?

In [64]:
%%sql
WITH names AS(
    SELECT climber_name, climb_date
    FROM Climb
    INNER JOIN Participate ON Climb.climb_id = Participate.climb_id
)
SELECT climber_name
FROM names
WHERE climb_date < 
    (SELECT MIN(climb_date)
     FROM names
     GROUP BY climber_name
     HAVING climber_name = 'Anna');

3 rows affected.

[('Beth',), ('Ellen',), ('David',)]

## Part g (15 points)

List all of the (climber, range) pairs, such that the climber has climbed every peak of that range.

In [89]:
%%sql
DROP TABLE IF EXISTS pairs;
CREATE TABLE pairs AS(
    SELECT climber_name, peak_range, peak_name
    FROM Peak
    INNER JOIN Climb ON Peak.peak_rank = Climb.peak_rank
    INNER JOIN Participate ON Climb.climb_id = Participate.climb_id
);

DROP TABLE IF EXISTS selection;
CREATE TABLE selection AS(
    (SELECT peak_range, COUNT(peak_name) AS count
    FROM Peak
    GROUP BY peak_range)
    EXCEPT
    (SELECT peak_range, COUNT(DISTINCT peak_name) AS count
    FROM pairs
    GROUP BY peak_range)
);

SELECT DISTINCT climber_name, peak_range
FROM pairs
WHERE peak_range NOT IN(
    SELECT peak_range
    FROM selection
);

Done.
18 rows affected.
Done.
53 rows affected.
2 rows affected.

[('Beth', 'Culebra Range'), ('David', 'Culebra Range')]

# Problem 3 (12 points)

In [99]:
%%sql

DROP TABLE IF EXISTS Data;

CREATE TABLE Data (a INT);

INSERT INTO Data VALUES
    (2),
    (4),
    (5),
    (2),
    (NULL),
    (1);

Done.
Done.
6 rows affected.

[]

In [100]:
%%sql

SELECT DISTINCT *
FROM Data
WHERE a NOT IN (SELECT data1.a
                FROM Data AS data1
                INNER JOIN Data AS data2 ON data1.a < data2.a);

1 rows affected.

[(5,)]

Consider the above table definition and query.  Note the atypical join condition.

In the following box, describe the semantics of the query --- i.e., what are the query results.  Determining the general case isn't too hard.  More importantly, however, identify and describe any special cases.  Don't forget about NULL!  Your description should not be in terms of any built-in SQL function, since it's unclear whether you understand SQL function special cases and also since SQL function semantics can vary among implementations.

We have provided one set of sample data.  You may change the set of sample data to account for any special cases.  That would be a good way to test your semantics hypotheses.  However, you should be able to understand the semantics without even running the query.

This is actually quite a particular case. Essentially, we are comparing data to itself: with regards to the inequlity sign, we need to do 6 * 5 = 30 times comparison. As a result, 1 is on smaller side for 4 times, 2 for 4 times, while 4 for 1 time (of course, the sequence depends on the priority). Meanwhile, operation involved with NULL never gives a definate result. Consequently, only 5 preserves after the opertation. (The breakdown, thinking process can be found following this column).

In [101]:
%%sql
SELECT data1.a
FROM Data AS data1
INNER JOIN Data AS data2 ON data1.a < data2.a

9 rows affected.

[(2,), (2,), (4,), (2,), (2,), (1,), (1,), (1,), (1,)]

In [103]:
%%sql
SELECT data1.a
FROM Data AS data1;

6 rows affected.

[(2,), (4,), (5,), (2,), (None,), (1,)]